pragun/super_mouse_stm32f4_usb_host/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.cpp
/**
  ******************************************************************************
  * @file    usbh_hid.c
  * @author  MCD Application Team
  * @brief   This file is the HID Layer Handlers for USB Host HID class.
  *
  * @verbatim
  *
  *          ===================================================================
  *                                HID Class  Description
  *          ===================================================================
  *           This module manages the HID class V1.11 following the "Device Class Definition
  *           for Human Interface Devices (HID) Version 1.11 Jun 27, 2001".
  *           This driver implements the following aspects of the specification:
  *             - The Boot Interface Subclass
  *             - The Mouse and Keyboard protocols
  *
  *  @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                      http://www.st.com/SLA0044
  *
  ******************************************************************************
  */

  /* BSPDependencies
  - "stm32xxxxx_{eval}{discovery}{nucleo_144}.c"
  - "stm32xxxxx_{eval}{discovery}_io.c"
  - "stm32xxxxx_{eval}{discovery}{adafruit}_lcd.c"
  - "stm32xxxxx_{eval}{discovery}_sdram.c"
  EndBSPDependencies */

/* Includes ------------------------------------------------------------------*/
#include <logitech_g600.hpp>
#include <generic_hid_driver.hpp>
#include <usbh_hid.hpp>


#include "stdbool.h"
//#include "hid_device_drivers.h"


/** @addtogroup USBH_LIB
* @{
*/

/** @addtogroup USBH_CLASS
* @{
*/

/** @addtogroup USBH_HID_CLASS
* @{
*/

/** @defgroup USBH_HID_CORE
* @brief    This file includes HID Layer Handlers for USB Host HID class.
* @{
*/

/** @defgroup USBH_HID_CORE_Private_TypesDefinitions
* @{
*/
/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_Defines
* @{
*/
/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_Macros
* @{
*/
/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_Variables
* @{
*/

/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_FunctionPrototypes
* @{
*/

std::vector<uint8_t>  USBH_FindInterfaces(USBH_HandleTypeDef *phost, uint8_t Class, uint8_t SubClass, uint8_t Protocol);

static USBH_StatusTypeDef USBH_HID_InterfaceInit  (USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_InterfaceDeInit  (USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_ClassRequest(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_SOFProcess(USBH_HandleTypeDef *phost);
static void  USBH_HID_ParseHIDDesc (HID_DescTypeDef *desc, uint8_t *buf);

static USBH_StatusTypeDef USBH_HID_InterfaceInitHelper(USBH_HandleTypeDef *phost, uint8_t protocol);
extern USBH_StatusTypeDef USBH_HID_MouseInit(USBH_HandleTypeDef *phost, uint8_t interface);
extern USBH_StatusTypeDef USBH_HID_KeybdInit(USBH_HandleTypeDef *phost, uint8_t interface);

extern uint8_t MouseCallback(USBH_HandleTypeDef *phost, uint8_t *buff, uint8_t len);
extern uint8_t KeyboardCallback(USBH_HandleTypeDef *phost, uint8_t *buff, uint8_t len);
extern uint8_t PrintHexBuf(uint8_t *buff, uint8_t len);

USBH_ClassTypeDef  HID_Class =
{
  "HID",
  USB_HID_CLASS,
  USBH_HID_InterfaceInit,
  USBH_HID_InterfaceDeInit,
  USBH_HID_ClassRequest,
  USBH_HID_Process,
  USBH_HID_SOFProcess,
  NULL,
};


HID_Device_Driver *HID_Device_Driver_Obj;

/**
* @}
*/

/** @defgroup USBH_HID_CORE_Private_Functions
* @{
*/


/**
  * @brief  USBH_HID_InterfaceInit
  *         The function init the HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */


static USBH_StatusTypeDef USBH_HID_DriverInit(USBH_HandleTypeDef *phost)
{

  uint16_t vid = phost->device.DevDesc.idVendor;
  uint16_t pid = phost->device.DevDesc.idProduct;
  std::vector<uint8_t> interfaces;

  HID_Device_Driver_Obj = NULL;
  if ((vid == 0x46d) && (pid == 0xc24a)){ //Logitech G600
	  HID_Device_Driver_Obj = (HID_Device_Driver*) new Logitech_G600_Mouse_Driver();
	  interfaces = HID_Device_Driver_Obj->hid_interface_list();
  }else{
	  HID_Device_Driver_Obj = (HID_Device_Driver*) new Generic_HID_Driver();
	  interfaces = USBH_FindInterfaces(phost, USB_HID_CLASS, 0xFFu, 0xFFu);
  }

  if(HID_Device_Driver_Obj != NULL){
	  USBH_StatusTypeDef statuses[] = {USBH_FAIL,USBH_FAIL};
	  uint8_t i = 0;
	  USBH_StatusTypeDef status = USBH_FAIL;

	  phost->pActiveClass->pData = (HID_HandleTypeDef *)USBH_malloc (sizeof(HID_Composite_TypeDef));
	  HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	  HID_Composite->num_interfaces = 0;
	  HID_Composite->interface_to_be_processed = 0;

	  for ( ;i < interfaces.size(); i++){
		  statuses[i] = USBH_HID_InterfaceInitHelper(phost, interfaces[i]);
		  HID_Device_Driver_Obj->prepare_hid_handle(interfaces[i], HID_Composite->HID_Handles[HID_Composite->num_interfaces-1]);
	  }

	  if((statuses[0] == USBH_OK) && (statuses[1] == USBH_OK)){
		  status = USBH_OK;
	  }
	  return status;
  }else{
	  return USBH_FAIL;
  }
}


static USBH_StatusTypeDef USBH_HID_DriverLessInit (USBH_HandleTypeDef *phost)
{
  uint8_t protocol_list[] = {HID_MOUSE_BOOT_CODE,HID_KEYBRD_BOOT_CODE};
  uint8_t i = 0U;
  USBH_StatusTypeDef statuses[] = {USBH_FAIL,USBH_FAIL};
  USBH_StatusTypeDef status = USBH_FAIL;
  uint8_t interface;

  phost->pActiveClass->pData = (HID_HandleTypeDef *)USBH_malloc (sizeof(HID_Composite_TypeDef));
  HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
  HID_Composite->num_interfaces = 0;
  HID_Composite->interface_to_be_processed = 0;

  for ( ;i < HID_MAX_COMPOSITED_INTERFACES; i++){
	  interface = USBH_FindInterface(phost, phost->pActiveClass->ClassCode, 0xFFU, protocol_list[i]);
	  if(interface == 0xFFU) /* No Valid Interface */
	  	{
	  		status = USBH_FAIL;
	  		USBH_DbgLog ("Cannot Find the interface for %s class.", phost->pActiveClass->Name);
	  	}
	  statuses[i] = USBH_HID_InterfaceInitHelper(phost, interface);
  }

