pragun/super_mouse_stm32f4_usb_host/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.cpp
  if((statuses[0] == USBH_OK) && (statuses[1] == USBH_OK)){
	  status = USBH_OK;
  }

  return status;
}

static USBH_StatusTypeDef USBH_HID_InterfaceInit (USBH_HandleTypeDef *phost)
{
	if(USBH_HID_DriverInit(phost) == USBH_OK){
		return USBH_OK;
	}
	else{
		return USBH_HID_DriverLessInit(phost);
	}
}

static USBH_StatusTypeDef USBH_HID_InterfaceInitHelper(USBH_HandleTypeDef *phost, uint8_t interface){
	uint8_t max_ep;
	uint8_t num = 0U;
	HID_HandleTypeDef* HID_Handle;

	HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	USBH_StatusTypeDef status = USBH_FAIL;

	USBH_SelectInterface (phost, interface);
	HID_Composite->HID_Handles[HID_Composite->num_interfaces] = (HID_HandleTypeDef *)USBH_malloc (sizeof(HID_HandleTypeDef));
	HID_Handle = HID_Composite->HID_Handles[HID_Composite->num_interfaces];
	HID_Composite->num_interfaces++;

	HID_Handle->state = HID_ERROR;
	HID_Handle->interface = interface;

	/*Decode Bootclass Protocol: Mouse or Keyboard*/
	HID_Handle->supports_set_protocol = 0;
	if(phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bInterfaceSubClass == HID_BOOT_CODE)
	{
		HID_Handle->supports_set_protocol = 1;
	}

	/*
	if(phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bInterfaceProtocol == HID_KEYBRD_BOOT_CODE)
	{
		USBH_UsrLog ("KeyBoard device found!");
		HAL_Delay(50);
		//HID_Handle->Init =  USBH_HID_KeybdInit;
		//HID_Handle->Callback = KeyboardCallback;
	}
	else if(phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bInterfaceProtocol  == HID_MOUSE_BOOT_CODE)
	{
		USBH_UsrLog ("Mouse device found!");
		HAL_Delay(50);
		//HID_Handle->Init =  USBH_HID_MouseInit;
		//HID_Handle->Callback = MouseCallback;
	}
	else
	{
		USBH_UsrLog ("Protocol not supported.");
		return USBH_FAIL;
	} */


	HID_Handle->state     = HID_INIT;
	HID_Handle->ctl_state = HID_REQ_INIT;
	HID_Handle->ep_addr   = phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[0].bEndpointAddress;
	HID_Handle->length    = phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[0].wMaxPacketSize;
	HID_Handle->poll      = phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[0].bInterval ;
	HID_Handle->report_buffer = 0;
	HID_Handle->report_descriptor_buffer = 0;

	if (HID_Handle->poll  < HID_MIN_POLL)
	{
		HID_Handle->poll = HID_MIN_POLL;
	}


	/* Check fo available number of endpoints */
	/* Find the number of EPs in the Interface Descriptor */
	/* Choose the lower number in order not to overrun the buffer allocated */
	max_ep = ( (phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bNumEndpoints <= USBH_MAX_NUM_ENDPOINTS) ?
			phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bNumEndpoints :
			USBH_MAX_NUM_ENDPOINTS);


	/* Decode endpoint IN and OUT address from interface descriptor */
	for ( ;num < max_ep; num++)
	{
		if(phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[num].bEndpointAddress & 0x80U)
		{
			HID_Handle->InEp = (phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[num].bEndpointAddress);
			HID_Handle->InPipe  =\
					USBH_AllocPipe(phost, HID_Handle->InEp);

			/* Open pipe for IN endpoint */
			USBH_OpenPipe  (phost,
					HID_Handle->InPipe,
					HID_Handle->InEp,
					phost->device.address,
					phost->device.speed,
					USB_EP_TYPE_INTR,
					HID_Handle->length);

			USBH_LL_SetToggle (phost, HID_Handle->InPipe, 0U);

		}
		else
		{
			HID_Handle->OutEp = (phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[num].bEndpointAddress);
			HID_Handle->OutPipe  =\
					USBH_AllocPipe(phost, HID_Handle->OutEp);

			/* Open pipe for OUT endpoint */
			USBH_OpenPipe  (phost,
					HID_Handle->OutPipe,
					HID_Handle->OutEp,
					phost->device.address,
					phost->device.speed,
					USB_EP_TYPE_INTR,
					HID_Handle->length);

			USBH_LL_SetToggle (phost, HID_Handle->OutPipe, 0U);
		}

	}
	status = USBH_OK;

	return status;
}

/**
  * @brief  USBH_HID_InterfaceDeInit
  *         The function DeInit the Pipes used for the HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef static USBH_HID_InterfaceDeInit (USBH_HandleTypeDef *phost)
{
	HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	uint8_t num_interfaces = HID_Composite->num_interfaces;
	HID_HandleTypeDef	**HID_Handles =  HID_Composite->HID_Handles;
	HID_HandleTypeDef *HID_Handle;
	uint8_t i = 0;

	for (i=0; i<num_interfaces; i++){
		HID_Handle = HID_Handles[i];

		if(HID_Handle->InPipe != 0x00U)
		{
			USBH_ClosePipe  (phost, HID_Handle->InPipe);
			USBH_FreePipe  (phost, HID_Handle->InPipe);
			HID_Handle->InPipe = 0U;     /* Reset the pipe as Free */
		}

		if(HID_Handle->OutPipe != 0x00U)
		{
			USBH_ClosePipe(phost, HID_Handle->OutPipe);
			USBH_FreePipe  (phost, HID_Handle->OutPipe);
			HID_Handle->OutPipe = 0U;     /* Reset the pipe as Free */
		}

		HID_Device_Driver_Obj->hid_handle_deinit(HID_Handle);
	}

	delete HID_Device_Driver_Obj;

	if(phost->pActiveClass->pData)
	{
		USBH_free (phost->pActiveClass->pData);
		phost->pActiveClass->pData = 0U;
	}

	return USBH_OK;
}

/**
  * @brief  USBH_HID_ClassRequest
  *         The function is responsible for handling Standard requests
  *         for HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_ClassRequest(USBH_HandleTypeDef *phost)
{

	USBH_StatusTypeDef status         = USBH_BUSY;
	USBH_StatusTypeDef classReqStatus = USBH_BUSY;
	HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	uint8_t num_interfaces = HID_Composite->num_interfaces;
	HID_HandleTypeDef	**HID_Handles =  HID_Composite->HID_Handles;
	HID_HandleTypeDef *HID_Handle = HID_Handles[HID_Composite->interface_to_be_processed];
	uint8_t i = 0;
	bool hid_class_active = true;

	switch (HID_Handle->ctl_state)
	{
	case HID_REQ_INIT:
	case HID_REQ_GET_HID_DESC:
		/* Get HID Desc */
		if (USBH_HID_GetHIDDescriptor(phost, HID_Handle->interface, phost->device.Data, USB_HID_DESC_SIZE)== USBH_OK)
		{
			USBH_HID_ParseHIDDesc(&HID_Handle->HID_Desc, phost->device.Data);
			HID_Handle->ctl_state = HID_REQ_GET_REPORT_DESC;
		}

		break;
	case HID_REQ_GET_REPORT_DESC:
		/* Get Report Desc */
		if (USBH_HID_GetHIDReportDescriptor(phost, HID_Handle->interface, phost->device.Data , HID_Handle->HID_Desc.wItemLength) == USBH_OK)
		{
			HID_Device_Driver_Obj->process_hid_report_descriptor(HID_Handle, phost->device.Data, HID_Handle->HID_Desc.wItemLength);
			/* The descriptor is available in phost->device.Data */
			//printf("Received Report Descriptor for interface: %d, size:%d\r\n", HID_Handle->interface, HID_Handle->HID_Desc.wItemLength);
			//PrintHexBuf(HID_Handle->report_descriptor_buffer, HID_Handle->HID_Desc.wItemLength);
			HID_Handle->ctl_state = HID_REQ_SET_IDLE;
			HAL_Delay(50);
		}

		break;

	case HID_REQ_SET_IDLE:

		classReqStatus = USBH_HID_SetIdle (phost, 0U, 0U, HID_Handle->interface);

		/* set Idle */
		if (classReqStatus == USBH_OK)
		{
			if (HID_Handle->supports_set_protocol){
				HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
			}else{
				HID_Handle->ctl_state = HID_REQ_IDLE;
			}

