pragun/super_mouse_stm32f4_usb_host/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.cpp
		}
		else
		{
			if(classReqStatus == USBH_NOT_SUPPORTED)
			{
				if (HID_Handle->supports_set_protocol){
					HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
				}else{
					HID_Handle->ctl_state = HID_REQ_IDLE;
				}
			}
		}
		break;

	case HID_REQ_SET_PROTOCOL:
		/* set protocol */
		if (USBH_HID_SetProtocol (phost, 0U, HID_Handle->interface) == USBH_OK)
		{
			HID_Handle->ctl_state = HID_REQ_IDLE;
		}
		break;

	case HID_REQ_IDLE:
	default:
		break;
	}

	for (i=0; i<num_interfaces; i++){
		// This favors an interface for processing if its control state hasn't progressed as much as the next to be processed interface
		if (HID_Composite->HID_Handles[i]->ctl_state < HID_Composite->HID_Handles[HID_Composite->interface_to_be_processed]->ctl_state){
			HID_Composite->interface_to_be_processed = i;
		}
	}

	//Check to make sure that all HID interfaces have a ctl_state of HID_REQ_IDLE before declaring the
	//HID class active
	for (i=0; i<num_interfaces; i++){
		hid_class_active = hid_class_active && (HID_Composite->HID_Handles[i]->ctl_state == HID_REQ_IDLE);
	}
	if(hid_class_active){
		phost->pUser(phost, HOST_USER_CLASS_ACTIVE);
		status = USBH_OK;
	}

	return status;
}


//USBH_HID_Process_new
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost)
{
	USBH_StatusTypeDef status = USBH_OK;

	HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	uint8_t num_interfaces = HID_Composite->num_interfaces;
	HID_HandleTypeDef	**HID_Handles =  HID_Composite->HID_Handles;
	HID_HandleTypeDef *HID_Handle = HID_Handles[HID_Composite->interface_to_be_processed];
	uint8_t i = 0;

	switch (HID_Handle->state)
	{
	case HID_INIT:
		HID_Device_Driver_Obj->hid_handle_init(HID_Handle);
		HID_Handle->state = HID_IDLE;
		break;

	case HID_IDLE:
		status = USBH_HID_GetReport (phost, 0x01U, 0U, HID_Handle->report_buffer, (uint8_t)HID_Handle->length, HID_Handle->interface);
		if (status == USBH_OK)
		{
			//USBH_HID_FifoWrite(&HID_Handle->fifo, HID_Handle->pData, HID_Handle->length);

			HID_Handle->state = HID_SYNC;
		}
		else if (status == USBH_BUSY)
		{
			HID_Handle->state = HID_IDLE;
			status = USBH_OK;
		}
		else if (status == USBH_NOT_SUPPORTED)
		{
			HID_Handle->state = HID_SYNC;
			status = USBH_OK;
		}
		else
		{
			HID_Handle->state = HID_ERROR;
			status = USBH_FAIL;
		}

		break;

	case HID_SYNC:
		/* Sync with start of Even Frame */
		if(phost->Timer & 1U)
		{
			HID_Handle->state = HID_GET_DATA;
		}

		break;

	case HID_GET_DATA:
		USBH_InterruptReceiveData(phost, HID_Handle->report_buffer,
				(uint8_t)HID_Handle->length,
				HID_Handle->InPipe);

		HID_Handle->state = HID_POLL;
		HID_Handle->timer = phost->Timer;
		HID_Handle->DataReady = 0U;
		break;

	case HID_POLL:
		if(USBH_LL_GetURBState(phost , HID_Handle->InPipe) == USBH_URB_DONE)
		{
			if(HID_Handle->DataReady == 0U)
			{
				//USBH_HID_FifoWrite(&HID_Handle->fifo, HID_Handle->pData, HID_Handle->length);
				HID_Handle->DataReady = 1U;
				//HID_Handle->Callback(phost,HID_Handle->pData, HID_Handle->length);
				HID_Device_Driver_Obj->process_hid_report(HID_Handle, HID_Handle->report_buffer, HID_Handle->length);
				//USBH_HID_EventCallback(phost);

#if (USBH_USE_OS == 1U)
				phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
				(void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
				(void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
			}
		}
		else
		{
			/* IN Endpoint Stalled */
			if(USBH_LL_GetURBState(phost, HID_Handle->InPipe) == USBH_URB_STALL)
			{
				/* Issue Clear Feature on interrupt IN endpoint */
				if(USBH_ClrFeature(phost, HID_Handle->ep_addr) == USBH_OK)
				{
					/* Change state to issue next IN token */
					HID_Handle->state = HID_GET_DATA;
				}
			}
		}
		break;

	default:
		break;
	}

	HID_Composite->interface_to_be_processed = (HID_Composite->interface_to_be_processed + 1) % num_interfaces;
	for (i=0; i<num_interfaces; i++){
		// This favors an interface for processing if its control state hasn't progressed as much as the next to be processed interface
		if (HID_Composite->HID_Handles[i]->state < HID_Handle->state){
			HID_Composite->interface_to_be_processed = i;
		}
	}

	return status;
}


/**
  * @brief  USBH_HID_SOFProcess
  *         The function is for managing the SOF Process
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_SOFProcess(USBH_HandleTypeDef *phost)
{
	HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	uint8_t num_interfaces = HID_Composite->num_interfaces;
	HID_HandleTypeDef	**HID_Handles =  HID_Composite->HID_Handles;
	HID_HandleTypeDef *HID_Handle;
	uint8_t i = 0;

	for (i=0; i<num_interfaces; i++){
		HID_Handle = HID_Handles[i];
		if(HID_Handle->state == HID_POLL)
		  {
		    if(( phost->Timer - HID_Handle->timer) >= HID_Handle->poll)
		    {
		      HID_Handle->state = HID_GET_DATA;
		    }
		  }
	}
  return USBH_OK;
}

/**
* @brief  USBH_Get_HID_ReportDescriptor
  *         Issue report Descriptor command to the device. Once the response
  *         received, parse the report descriptor and update the status.
  * @param  phost: Host handle
  * @param  Length : HID Report Descriptor Length
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_HID_GetHIDReportDescriptor(USBH_HandleTypeDef *phost,
													uint8_t wIndex, uint8_t *buf,
                                                    uint16_t length)
{

  USBH_StatusTypeDef status;

  /*
  status = USBH_GetDescriptor(phost,
                              USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
                              USB_DESC_HID_REPORT,
                              phost->device.Data,
                              length);
                              */

  status = USBH_GetDescriptor_wIndex( phost,
		  	  	  	  	  	  	  	  USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
									  USB_DESC_HID_REPORT,
									  wIndex,
									  buf,
									  length);

  /* HID report descriptor is available in phost->device.Data.
  In case of USB Boot Mode devices for In report handling ,
  HID report descriptor parsing is not required.
  In case, for supporting Non-Boot Protocol devices and output reports,
  user may parse the report descriptor*/


